ishop/app/controllers/catalogs_controller.rb

  def show
    @catalog = Catalog.find(params[:id])
---
SELECT * FROM "catalogs" WHERE ("catalogs"."id" = 1)

  def edit
    @catalog = Catalog.find(params[:id])
---
SELECT * FROM "catalogs" WHERE ("catalogs"."id" = 1)

  def create
    @catalog = Catalog.new(params[:catalog])

    respond_to do |format|
      if @catalog.save
---
INSERT INTO "catalogs" ("name", "created_at", "updated_at", "about") VALUES('Каталог всяких разных', '2010-12-15 14:18:24', '2010-12-15 14:18:24', 'Тут лежит много всего веселого')

  def update
    @catalog = Catalog.find(params[:id])

    respond_to do |format|
      if @catalog.update_attributes(params[:catalog])
---
SELECT * FROM "catalogs" WHERE ("catalogs"."id" = 3)
UPDATE "catalogs" SET "updated_at" = '2010-12-15 14:17:41', "name" = 'Каталог продуктов Опа' WHERE "id" = 1

  def destroy
    @catalog = Catalog.find(params[:id])
    @catalog.destroy
---
SELECT * FROM "catalogs" WHERE ("catalogs"."id" = 2)
DELETE FROM "catalogs" WHERE "id" = 2