ishop/app/controllers/goods_controller.rb

  def show
    @good = Good.find(params[:id])
---
SELECT * FROM "goods" WHERE ("goods"."id" = 1)

  def edit
    @good = Good.find(params[:id])
---
SELECT * FROM "goods" WHERE ("goods"."id" = 1)

  def create
    @good = Good.new(params[:good])

    respond_to do |format|
      if @good.save
---
INSERT INTO "goods" ("name", "price", "created_at", "catalog_id", "updated_at", "size_x", "weight", "size_y", "quant", "size_z", "about", "provider") VALUES('Колбаса', 100.0, '2010-12-13 19:27:45', NULL, '2010-12-13 19:27:45', 2.0, 0.5, 45.0, NULL, 15.0, 'Это очень хорошая колбаса, ее стоит покупать всегда, когда у вас есть такая возможность потому что это, едрит-коптить, самая четкая колбаса', NULL)

  def update
    @good = Good.find(params[:id])

    respond_to do |format|
      if @good.update_attributes(params[:good])
---
SELECT * FROM "goods" WHERE ("goods"."id" = 1)
UPDATE "goods" SET "updated_at" = '2010-12-15 14:42:19', "catalog_id" = 1, "provider" = 'Суперона' WHERE "id" = 1

  def destroy
    @good = Good.find(params[:id])
    @good.destroy
---
SELECT * FROM "goods" WHERE ("goods"."id" = 1)
DELETE FROM "goods" WHERE "id" = 1