ishop/app/controllers/user_controller.rb

	def index
		@user=User.find(:all, :order => :login)
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

	def create
		@user=User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "bday", "gender", "bmounth", "login", "password", "byear", "email") VALUES('2010-12-16 14:27:38', '2010-12-16 14:27:38', NULL, 'male', NULL, '111', '111', NULL, '111@mail.ru')

	def update
		@user=User.find(params[:id])
			if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 3)
UPDATE "users" SET "updated_at" = '2010-12-15 17:43:44', "email" = 'crazy1@mail.ru', "login" = 'Crazy1' WHERE "id" = 1